specters312/SVD_DUMP/Atmel/ATSAM4LS8B.svd
        <register>
          <dim>3</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>SR%s</name>
          <description>Status Register Channel</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>COVFSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No counter overflow has occurred since the last read of the Status Register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A counter overflow has occurred since the last read of the Status Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LOVRSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Load overrun has not occurred since the last read of the Status Register or WAVE:1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>RA or RB have been loaded at least twice without any read of the corresponding register since the last read of the StatusRegister, if WAVE:0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPASSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>RA Compare has not occurred since the last read of the Status Register or WAVE:0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>RA Compare has occurred since the last read of the Status Register, if WAVE:1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPBSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>RB Compare has not occurred since the last read of the Status Register or WAVE:0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>RB Compare has occurred since the last read of the Status Register, if WAVE:1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPCSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>RC Compare has not occurred since the last read of the Status Register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>RC Compare has occurred since the last read of the Status Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LDRASSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>RA Load has not occurred since the last read of the Status Register or WAVE:1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>RA Load has occurred since the last read of the Status Register, if WAVE:0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LDRBSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>RB Load has not occurred since the last read of the Status Register or WAVE:1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>RB Load has occurred since the last read of the Status Register, if WAVE:0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ETRGSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>External trigger has not occurred since the last read of the Status Register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>External trigger has occurred since the last read of the Status Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSTA</name>
              <description>Clock Enabling Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CLKSTASelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clock is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTIOA</name>
              <description>TIOA Mirror</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MTIOASelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>TIOA is low. If WAVE:0, this means that TIOA pin is low. If WAVE:1, this means that TIOA is driven low.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>TIOA is high. If WAVE:0, this means that TIOA pin is high. If WAVE:1, this means that TIOA is driven high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTIOB</name>
              <description>TIOB Mirror</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MTIOBSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>TIOB is low. If WAVE:0, this means that TIOB pin is low. If WAVE:1, this means that TIOB is driven low.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>TIOB is high. If WAVE:0, this means that TIOB pin is high. If WAVE:1, this means that TIOB is driven high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Version Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000402</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Reserved. Value subject to change. No functionality associated. This is the Atmel internal version of the macrocell.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Reserved.  Value subject to change.  No functionality associated.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protect Mode Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protect Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protect Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
