specters312/SVD_DUMP/Atmel/ATSAM4LS8B.svd
        <register>
          <name>UDINTECLR</name>
          <description>Device Global Interrupt Enable Clear Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SUSPEC</name>
              <description>SUSP Interrupt Enable Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MSOFEC</name>
              <description>MSOF Interrupt Enable Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SOFEC</name>
              <description>SOF Interrupt Enable Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EORSTEC</name>
              <description>EORST Interrupt Enable Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WAKEUPEC</name>
              <description>WAKEUP Interrupt Enable Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EORSMEC</name>
              <description>EORSM Interrupt Enable Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UPRSMEC</name>
              <description>UPRSM Interrupt Enable Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP0INTEC</name>
              <description>EP0INT Interrupt Enable Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP1INTEC</name>
              <description>EP1INT Interrupt Enable Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP2INTEC</name>
              <description>EP2INT Interrupt Enable Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP3INTEC</name>
              <description>EP3INT Interrupt Enable Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP4INTEC</name>
              <description>EP4INT Interrupt Enable Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP5INTEC</name>
              <description>EP5INT Interrupt Enable Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP6INTEC</name>
              <description>EP6INT Interrupt Enable Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP7INTEC</name>
              <description>EP7INT Interrupt Enable Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDINTESET</name>
          <description>Device Global Interrupt Enable Set Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SUSPES</name>
              <description>SUSP Interrupt Enable Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MSOFES</name>
              <description>MSOF Interrupt Enable Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SOFES</name>
              <description>SOF Interrupt Enable Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EORSTES</name>
              <description>EORST Interrupt Enable Set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WAKEUPES</name>
              <description>WAKEUP Interrupt Enable Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EORSMES</name>
              <description>EORSM Interrupt Enable Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UPRSMES</name>
              <description>UPRSM Interrupt Enable Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP0INTES</name>
              <description>EP0INT Interrupt Enable Set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP1INTES</name>
              <description>EP1INT Interrupt Enable Set</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP2INTES</name>
              <description>EP2INT Interrupt Enable Set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP3INTES</name>
              <description>EP3INT Interrupt Enable Set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP4INTES</name>
              <description>EP4INT Interrupt Enable Set</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP5INTES</name>
              <description>EP5INT Interrupt Enable Set</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP6INTES</name>
              <description>EP6INT Interrupt Enable Set</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EP7INTES</name>
              <description>EP7INT Interrupt Enable Set</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDINTSET</name>
          <description>Device Global Interrupt Set Regsiter</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SUSPS</name>
              <description>SUSP Interrupt Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MSOFS</name>
              <description>MSOF Interrupt Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SOFS</name>
              <description>SOF Interrupt Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EORSTS</name>
              <description>EORST Interrupt Set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WAKEUPS</name>
              <description>WAKEUP Interrupt Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EORSMS</name>
              <description>EORSM Interrupt Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UPRSMS</name>
              <description>UPRSM Interrupt Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UECFG0</name>
          <description>Endpoint Configuration Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPBK</name>
              <description>Endpoint Bank</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EPBKSelect</name>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOUBLE</name>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPSIZE</name>
              <description>Endpoint Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EPSIZESelect</name>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint Direction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EPDIRSelect</name>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EPTYPESelect</name>
                <enumeratedValue>
                  <name>CONTROL</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISOCHRONOUS</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BULK</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPNB</name>
              <description>Redirected Endpoint Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UECFG1</name>
          <description>Endpoint Configuration Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPBK</name>
              <description>Endpoint Bank</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EPBKSelect</name>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOUBLE</name>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPSIZE</name>
              <description>Endpoint Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EPSIZESelect</name>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint Direction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EPDIRSelect</name>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EPTYPESelect</name>
                <enumeratedValue>
                  <name>CONTROL</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISOCHRONOUS</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BULK</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPNB</name>
              <description>Redirected Endpoint Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UECFG2</name>
          <description>Endpoint Configuration Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPBK</name>
              <description>Endpoint Bank</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EPBKSelect</name>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOUBLE</name>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPSIZE</name>
              <description>Endpoint Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EPSIZESelect</name>
                <enumeratedValue>
                  <name>8</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint Direction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EPDIRSelect</name>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EPTYPESelect</name>
                <enumeratedValue>
                  <name>CONTROL</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISOCHRONOUS</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BULK</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPNB</name>
              <description>Redirected Endpoint Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
